2017-05-28-Generating-all-groupings-of-(1|2)*-summing-up-to-m.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-06-04 Sun 14:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generating all groupings of (1|2)* summing up to m</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/sitemap.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<h1 class="title">Generating all groupings of (1|2)* summing up to m</h1>

<p>
In a fun article <a href="https://www.amin.space/blog/2017/5/elemental_speller/">Spelling with Elemental Symbols</a> the author explores how to write a program that would spell out words with the symbols of the periodic table.  So for example the word <i>waste</i> might be spelled as <i>WAsTe</i> (<code>W</code> for <i>wolfram</i>, <code>As</code> for <i>arsenic</i> and <code>Te</code> for <i>tellurium</i>).
</p>

<p>
In the beginning their first idea was to generate all the possible splits into 1 and 2 letter groups (we call these strings <i>groupings</i>), then try all these combinations matching against the list of the symbols<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.  To generate the splits they would generate all the possible strings of 1 and 2 up to the length \(m\) and then filter out those which don't sum up to \(m\) (the length of the input word).  Little inspection shows that this grows exponentially and really isn't the way to go<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.  For \(m\) = 3 this would generate 15 possible strings (including the empty one) but only 3 are actually valid: \((1,1,1)\), \((1,2)\) and \((2,1)\).
</p>

<p>
This immediately got me thinking of dynamic programming and induction.  I figured it out in a couple minutes and then worked out a simple proof to show that my algorithm generates all the possible groupings.
</p>

<div id="outline-container-org64ff88b" class="outline-2">
<h2 id="org64ff88b">The algorithm</h2>
<div class="outline-text-2" id="text-org64ff88b">
<p>
How it works is rather simple:
</p>

<ul class="org-ul">
<li>If we are generating groupings of strings summing up to 0, return just the empty sequence.</li>
<li>If we are generating groupings of strings summing up to 1, return just the sequence <code>(1)</code>.</li>
<li>Otherwise return all the sequences created by prepending 1 to all
the sequences that sum to \(n-1\) combined all the sequences created by
prepending 2 to all the sequences that sum to \(n-2\) (so that the resulting sum is \(n\)).</li>
</ul>

<p>
The algorithm's nature was begging for a functional implementation so I naturally wrote it down in Lisp:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">generate-groupings</span> <span style="color: #888a85;">(</span>n<span style="color: #888a85;">)</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">cond</span>
   <span style="color: #888a85;">((</span>= n 0<span style="color: #888a85;">)</span> '<span style="color: #888a85;">(()))</span>
   <span style="color: #888a85;">((</span>= n 1<span style="color: #888a85;">)</span> '<span style="color: #888a85;">((</span>1<span style="color: #888a85;">)))</span>
   <span style="color: #888a85;">(</span><span style="color: #ad7fa8;">:else</span>
    <span style="color: #888a85;">(</span>append
     <span style="color: #888a85;">(</span>mapcar <span style="color: #888a85;">(</span><span style="color: #b4fa70;">lambda</span> <span style="color: #888a85;">(</span>x<span style="color: #888a85;">)</span> <span style="color: #888a85;">(</span>cons 1 x<span style="color: #888a85;">))</span> <span style="color: #888a85;">(</span>generate-groupings <span style="color: #888a85;">(</span>- n 1<span style="color: #888a85;">)))</span>
     <span style="color: #888a85;">(</span>mapcar <span style="color: #888a85;">(</span><span style="color: #b4fa70;">lambda</span> <span style="color: #888a85;">(</span>x<span style="color: #888a85;">)</span> <span style="color: #888a85;">(</span>cons 2 x<span style="color: #888a85;">))</span> <span style="color: #888a85;">(</span>generate-groupings <span style="color: #888a85;">(</span>- n 2<span style="color: #888a85;">)))))))</span>
</pre>
</div>

<p>
Here's an equivalent Python version.  Please note I'm not too big into Python :)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">prepend</span>(x, <span style="color: #ad7fa8;">list</span>):
    <span style="color: #ad7fa8;">list</span>.insert(0, x)
    <span style="color: #b4fa70;">return</span> <span style="color: #ad7fa8;">list</span>


<span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">generate_groupings</span>(n):
    <span style="color: #b4fa70;">if</span> n == 0:
        <span style="color: #b4fa70;">return</span> [[]]
    <span style="color: #b4fa70;">elif</span> n == 1:
        <span style="color: #b4fa70;">return</span> [[1]]
    <span style="color: #b4fa70;">else</span>:
        <span style="color: #fcaf3e;">l1</span> = [prepend(1,x) <span style="color: #b4fa70;">for</span> x <span style="color: #b4fa70;">in</span> generate_groupings(n - 1)]
        <span style="color: #fcaf3e;">l2</span> = [prepend(2,x) <span style="color: #b4fa70;">for</span> x <span style="color: #b4fa70;">in</span> generate_groupings(n - 2)]
        <span style="color: #b4fa70;">return</span> l1+l2
</pre>
</div>
</div>
</div>

<div id="outline-container-org16ddb76" class="outline-2">
<h2 id="org16ddb76">Proof</h2>
<div class="outline-text-2" id="text-org16ddb76">
<p>
Proof will be carried out by <a href="https://en.wikipedia.org/wiki/Mathematical_induction">induction</a>.  In short, induction works as follows.  You first prove the induction base, which is the base truth from which you will derive all other truths.  In our case this will be the fact that the algorithm works for \(n = 0\) and \(n = 1\).
</p>

<p>
Why this is true follows directly from the definition of the first two bullets of the algorithm.  They are just hard-coded enumerations of all the possibilities.
</p>

<p>
Now the fun part.  If we prove that the proposition is true for \(n + 1\) while we <i>assume</i> it works for all \(k \leq n\), we proved the proposition for <i>all</i> \(n\).  This is called the induction hypothesis.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
The whole thing works because it allows us to "turtle all the way" down to the basic fact.  For example, to prove something works for \(n = 3\), we first use the basic fact that it works for \(n = 1\), then assuming it works (which it does!) we use the induction hypothesis which grants us that the proposition works for \(n = 2\).  We repeat again to show that the proposition works for \(n = 3\) assuming it works for \(n = 2\) (which it does, we just showed it!).  It is a bit magical so think about it for a bit until it is clear.
</p>

<p>
Let's introduce some notation:  I will write \(g(n)\) to mean the set of all the sequences that sum up to \(n\).  When I write \(1:x\) this means take the <i>set</i> \(x\) and to each element of it prepend a 1.  So that \(1:\{(1,1), (2)\}\) = \(\{(1,1,1), (1,2)\}\).  I will use \(+\) to mean the union of two sets.
</p>

<p>
Now, for the induction hypothesis we take: \(g(n) = 1:g(n-1) + 2:g(n-2)\).  This just translates the last bullet of the algorithm into a "mathematical" form.
</p>

<p>
We are trying to show that \(g(n+1) = 1:g(n) + 2:g(n-1)\) (this is the form of the proposition for \(n+1\)) <i>assuming</i> it works for \(g(n)\).
</p>

<p>
The proof is now very straight forward.  Assume we have a string which sums up to \(n+1 >= 2\) (the cases for 0 and 1 were covered in the basic step).  Then the string must start with either 1 or 2.
</p>

<p>
If it starts with 1 the rest of it must sum up to \((n + 1) - 1 = n\).  By using the hypothesis we already know that all those strings form the set \(1:g(n-1) + 2:g(n-2)\).  When we prepend 1 to each string of this set we get \(1:1:g(n-1) + 1:2:g(n-2)\) which really is the same as \(1:(1:g(n-1) + 2:g(n-2))\) = \(1:g(n)\).  We use the fact that it does not matter if we first prepend and than take the union or first take the union and then prepend (mathematicians say that "the prepending commutes with the union").
</p>

<p>
Similarly if it starts with 2 the rest of it must sum up to \((n + 1) - 2 = n - 1\) which forms the the set \(1:g(n-2) + 2:g(n-3)\).  Prepending 2 in front gives us \(2:1:g(n-2) + 2:2:g(n-3)\) = \(2:(1:g(n-2) + 2:g(n-3))\) = \(2:g(n-1)\).
</p>

<p>
By taking the union of these two (and only!) options we get \(1:g(n) + 2:g(n-1)\) which is the desired result.
</p>

<p>
If you have any questions leave me a <a href="https://github.com/Fuco1/Fuco1.github.io/issues">comment</a>!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">Yes, this is awfully inefficient.  The author later rectifies this with a beautiful and fast linear algorithm.</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">To see this just imagine that 1 and 2 is actually 0 and 1 and you are generating all the binary numbers taking up to \(n\) bits.  This results in \((2^n)-1\) options.</div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara">We are actually using <i>strong</i> (a.k.a. <i>complete</i>) <a href="https://en.wikipedia.org/wiki/Mathematical_induction#Complete_induction">induction</a>.  This is equivalent to the simple induction you might have learned at university.</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2017-06-04 14:54</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-05-28-Generating-all-groupings-of-(1|2)*-summing-up-to-m.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
